<a href="https://colab.research.google.com/github/jahnavimidde/VsemML/blob/main/Lab1ml.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
s=pd.Series(['A,','B','C'])
print(s)

0    A,
1     B
2     C
dtype: object

In [ ]:
#9
import pandas as pd
df = pd.DataFrame({
    2014: [1, 2, 3, 4, 5],
    2015: [1, 12.3, 45.5, 78273, 56],
    2016: [1, 3, 7, 44, 33],
    2017: [1, 12.3, 45.5, 78273, 56],
    2018: [1, 3, 7, 44, 33]
}, index=['Madhu', 'Kusum', 'john', 'Ankit', 'Shruthi'])
print(df)

#10
print(df.index)
print(df.columns)
print(df.dtypes)

print(df.ndim)
print(df.shape)
print(df.size)
print(df.values)
print(df.tail(2))
print(df.iloc[:,:2])

data = {
    '2018': {
        'Madhu': 160000,
        'Kusum': 110000,
        'Kinshuk': 500000,
        'Ankit': 340000,
        'Shruti': 900000
    }
}
print(data)
df2 = pd.DataFrame({
    '2018': {
        'Madhu': 160000,
        'Kusum': 110000,
        'Kinshuk': 500000,
        'Ankit': 340000,
        'Shruti': 900000
    }
})
print(df2)
print(df2.empty)

#11
print(" 11 ____________________________________")
df[2018] = df2['2018']
print(df)
print(df.T)
print(df[2017])
print(df.loc[df.index.intersection(['Madhu', 'Sumeet']), [2017, 2018]])
print(df.index)
print(df.columns)
print(df.loc[['Shruthi'], [2016]])

# Add Sumeet's sales data
df.loc['Sumeet'] = [196.2, 37800, 52000, 78438, 38852]
print("sumeet",df)

# Drop 3rd row
df = df.drop(df.index[2])
print(df)



print(df2.drop(df.index[2]))

         2014     2015  2016     2017  2018
Madhu       1      1.0     1      1.0     1
Kusum       2     12.3     3     12.3     3
john        3     45.5     7     45.5     7
Ankit       4  78273.0    44  78273.0    44
Shruthi     5     56.0    33     56.0    33
Index(['Madhu', 'Kusum', 'john', 'Ankit', 'Shruthi'], dtype='object')
Index([2014, 2015, 2016, 2017, 2018], dtype='int64')
2014      int64
2015    float64
2016      int64
2017    float64
2018      int64
dtype: object
2
(5, 5)
25
[[1.0000e+00 1.0000e+00 1.0000e+00 1.0000e+00 1.0000e+00]
 [2.0000e+00 1.2300e+01 3.0000e+00 1.2300e+01 3.0000e+00]
 [3.0000e+00 4.5500e+01 7.0000e+00 4.5500e+01 7.0000e+00]
 [4.0000e+00 7.8273e+04 4.4000e+01 7.8273e+04 4.4000e+01]
 [5.0000e+00 5.6000e+01 3.3000e+01 5.6000e+01 3.3000e+01]]
         2014     2015  2016     2017  2018
Ankit       4  78273.0    44  78273.0    44
Shruthi     5     56.0    33     56.0    33
         2014     2015
Madhu       1      1.0
Kusum       2     12.3
john        3     45.5
Ankit       4  78273.0
Shruthi     5     56.0
{'2018': {'Madhu': 160000, 'Kusum': 110000, 'Kinshuk': 500000, 'Ankit': 340000, 'Shruti': 900000}}
           2018
Madhu    160000
Kusum    110000
Kinshuk  500000
Ankit    340000
Shruti   900000
False
 11 ____________________________________
         2014     2015  2016     2017      2018
Madhu       1      1.0     1      1.0  160000.0
Kusum       2     12.3     3     12.3  110000.0
john        3     45.5     7     45.5       NaN
Ankit       4  78273.0    44  78273.0  340000.0
Shruthi     5     56.0    33     56.0       NaN
         Madhu     Kusum  john     Ankit  Shruthi
2014       1.0       2.0   3.0       4.0      5.0
2015       1.0      12.3  45.5   78273.0     56.0
2016       1.0       3.0   7.0      44.0     33.0
2017       1.0      12.3  45.5   78273.0     56.0
2018  160000.0  110000.0   NaN  340000.0      NaN
Madhu          1.0
Kusum         12.3
john          45.5
Ankit      78273.0
Shruthi       56.0
Name: 2017, dtype: float64
       2017      2018
Madhu   1.0  160000.0
Index(['Madhu', 'Kusum', 'john', 'Ankit', 'Shruthi'], dtype='object')
Index([2014, 2015, 2016, 2017, 2018], dtype='int64')
         2016
Shruthi    33
sumeet           2014     2015     2016     2017      2018
Madhu      1.0      1.0      1.0      1.0  160000.0
Kusum      2.0     12.3      3.0     12.3  110000.0
john       3.0     45.5      7.0     45.5       NaN
Ankit      4.0  78273.0     44.0  78273.0  340000.0
Shruthi    5.0     56.0     33.0     56.0       NaN
Sumeet   196.2  37800.0  52000.0  78438.0   38852.0
          2014     2015     2016     2017      2018
Madhu      1.0      1.0      1.0      1.0  160000.0
Kusum      2.0     12.3      3.0     12.3  110000.0
Ankit      4.0  78273.0     44.0  78273.0  340000.0
Shruthi    5.0     56.0     33.0     56.0       NaN
Sumeet   196.2  37800.0  52000.0  78438.0   38852.0
           2018
Madhu    160000
Kusum    110000
Kinshuk  500000
Shruti   900000

In [ ]:
print(df2.drop('Kinshuk'))
#Change the name of the salesperson Ankit to
#Vivaan and Madhu to Shailesh.
#rename uses index and columns
print(df.rename(index={'Madhu':'Shailesh','Ankit':'Vivaan'},inplace=True))
df.loc['Shailesh',2018]=10000
print(df)
df = df.drop(['Shailesh', 'shailesh'], errors='ignore')

          2018
Madhu   160000
Kusum   110000
Ankit   340000
Shruti  900000
None
           2014     2015     2016     2017      2018
Kusum       2.0     12.3      3.0     12.3  110000.0
Vivaan      4.0  78273.0     44.0  78273.0  340000.0
Shruthi     5.0     56.0     33.0     56.0       NaN
Sumeet    196.2  37800.0  52000.0  78438.0   38852.0
Shailesh    NaN      NaN      NaN      NaN   10000.0

In [ ]:

import pandas as pd
df.to_csv('SalesFigures.csv',index=False,header=False)
reading=pd.read_csv('SalesFigures.csv',header=None)# pandas automatically understands the first row as header
reading.index=df.index
reading.columns=df.columns
print(reading)

          2014     2015     2016     2017      2018
Madhu      1.0      1.0      1.0      1.0  160000.0
Kusum      2.0     12.3      3.0     12.3  110000.0
Ankit      4.0  78273.0     44.0  78273.0  340000.0
Shruthi    5.0     56.0     33.0     56.0       NaN
Sumeet   196.2  37800.0  52000.0  78438.0   38852.0

In [ ]:
import pandas as pd

data = {
    'Item': ['TV', 'TV', 'TV', 'AC'],
    'Company': ['LG', 'VIDEOCON', 'LG', 'SONY'],
    'Rupees': [12000, 10000, 15000, 14000],
    'USD': [700, 650, 800, 750]
}

df = pd.DataFrame(data)


print(df)
new_rows = pd.DataFrame([
    {"Item": "TV", "Company": "SAMSUNG", "Rupees": 13000, "USD": 720},
    {"Item": "AC", "Company": "SONY", "Rupees": 16000, "USD": 790}
])
df = pd.concat([df, new_rows], ignore_index=True)
print(df)
#max price lg tv
print(df[(df['Item']=='TV')&(df['Company']=='LG')]['Rupees'].max())
print(sum(df['Rupees']))
print(df[(df['Company']=='SONY')]['USD'].median())

  Item   Company  Rupees  USD
0   TV        LG   12000  700
1   TV  VIDEOCON   10000  650
2   TV        LG   15000  800
3   AC      SONY   14000  750
  Item   Company  Rupees  USD
0   TV        LG   12000  700
1   TV  VIDEOCON   10000  650
2   TV        LG   15000  800
3   AC      SONY   14000  750
4   TV   SAMSUNG   13000  720
5   AC      SONY   16000  790
15000
80000
770.0

In [ ]:
import pandas as pd


data = {
    'Name': ['Aparna', 'Pankaj', 'Ram', 'Ramesh', 'Naveen', 'Krrishnav', 'Bhawna'],
    'Degree': ['MBA', 'BCA', 'M.Tech', 'MBA', None, 'BCA', 'MBA'],
    'Score': [90.0, None, 80.0, 98.0, 97.0, 78.0, 89.0]
}

df3 = pd.DataFrame(data)
print(df3)
print(df3.groupby("Degree")["Score"].max())
df['Score'].fillna(76)
print(df)
#df.set_index('Name')
#print(df)
# Group by Name and Degree, then calculate average Score
average_marks = df.groupby([df.index, 'Degree'])['Score'].mean()
print(average_marks)
print(df[df['Degree']=='MBA'].count())
print(len(df[df['Degree']=='MBA']))
print(df[df['Degree'] == 'BCA']['Score'].mode())

        Name  Degree  Score
0     Aparna     MBA   90.0
1     Pankaj     BCA    NaN
2        Ram  M.Tech   80.0
3     Ramesh     MBA   98.0
4     Naveen    None   97.0
5  Krrishnav     BCA   78.0
6     Bhawna     MBA   89.0
Degree
BCA       78.0
M.Tech    80.0
MBA       98.0
Name: Score, dtype: float64
           Degree  Score
Name
Aparna        MBA   90.0
Pankaj        BCA   76.0
Ram        M.Tech   80.0
Ramesh        MBA   98.0
Naveen       None   97.0
Krrishnav     BCA   78.0
Bhawna        MBA   89.0
Name       Degree
Aparna     MBA       90.0
Bhawna     MBA       89.0
Krrishnav  BCA       78.0
Pankaj     BCA       76.0
Ram        M.Tech    80.0
Ramesh     MBA       98.0
Name: Score, dtype: float64
Degree    3
Score     3
dtype: int64
3
0    76.0
1    78.0
Name: Score, dtype: float64

In [ ]:
import numpy as np


column_names = ['mpg', 'cylinders', 'displacement', 'horsepower',
                'weight', 'acceleration', 'model_year', 'origin', 'car_name']

# Load dataset
url = "http://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.data"
df=pd.read_csv(url,delim_whitespace=True,names=column_names,na_values="?")
print(df.describe(include="all"))

print(df.head(10))
print(df.ffill())
print(df.isnull().sum())
print(df.dropna())

/tmp/ipython-input-10-3439570444.py:9: FutureWarning: The 'delim_whitespace' keyword in pd.read_csv is deprecated and will be removed in a future version. Use ``sep='\s+'`` instead
  df=pd.read_csv(url,delim_whitespace=True,names=column_names,na_values="?")

               mpg   cylinders  displacement  horsepower       weight  \
count   398.000000  398.000000    398.000000  392.000000   398.000000
unique         NaN         NaN           NaN         NaN          NaN
top            NaN         NaN           NaN         NaN          NaN
freq           NaN         NaN           NaN         NaN          NaN
mean     23.514573    5.454774    193.425879  104.469388  2970.424623
std       7.815984    1.701004    104.269838   38.491160   846.841774
min       9.000000    3.000000     68.000000   46.000000  1613.000000
25%      17.500000    4.000000    104.250000   75.000000  2223.750000
50%      23.000000    4.000000    148.500000   93.500000  2803.500000
75%      29.000000    8.000000    262.000000  126.000000  3608.000000
max      46.600000    8.000000    455.000000  230.000000  5140.000000

        acceleration  model_year      origin    car_name
count     398.000000  398.000000  398.000000         398
unique           NaN         NaN         NaN         305
top              NaN         NaN         NaN  ford pinto
freq             NaN         NaN         NaN           6
mean       15.568090   76.010050    1.572864         NaN
std         2.757689    3.697627    0.802055         NaN
min         8.000000   70.000000    1.000000         NaN
25%        13.825000   73.000000    1.000000         NaN
50%        15.500000   76.000000    1.000000         NaN
75%        17.175000   79.000000    2.000000         NaN
max        24.800000   82.000000    3.000000         NaN
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    float64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    int64
 8   car_name      398 non-null    object
dtypes: float64(5), int64(3), object(1)
memory usage: 28.1+ KB
df: None
    mpg  cylinders  displacement  horsepower  weight  acceleration  \
0  18.0          8         307.0       130.0  3504.0          12.0
1  15.0          8         350.0       165.0  3693.0          11.5
2  18.0          8         318.0       150.0  3436.0          11.0
3  16.0          8         304.0       150.0  3433.0          12.0
4  17.0          8         302.0       140.0  3449.0          10.5
5  15.0          8         429.0       198.0  4341.0          10.0
6  14.0          8         454.0       220.0  4354.0           9.0
7  14.0          8         440.0       215.0  4312.0           8.5
8  14.0          8         455.0       225.0  4425.0          10.0
9  15.0          8         390.0       190.0  3850.0           8.5

   model_year  origin                   car_name
0          70       1  chevrolet chevelle malibu
1          70       1          buick skylark 320
2          70       1         plymouth satellite
3          70       1              amc rebel sst
4          70       1                ford torino
5          70       1           ford galaxie 500
6          70       1           chevrolet impala
7          70       1          plymouth fury iii
8          70       1           pontiac catalina
9          70       1         amc ambassador dpl
      mpg  cylinders  displacement  horsepower  weight  acceleration  \
0    18.0          8         307.0       130.0  3504.0          12.0
1    15.0          8         350.0       165.0  3693.0          11.5
2    18.0          8         318.0       150.0  3436.0          11.0
3    16.0          8         304.0       150.0  3433.0          12.0
4    17.0          8         302.0       140.0  3449.0          10.5
..    ...        ...           ...         ...     ...           ...
393  27.0          4         140.0        86.0  2790.0          15.6
394  44.0          4          97.0        52.0  2130.0          24.6
395  32.0          4         135.0        84.0  2295.0          11.6
396  28.0          4         120.0        79.0  2625.0          18.6
397  31.0          4         119.0        82.0  2720.0          19.4

     model_year  origin                   car_name
0            70       1  chevrolet chevelle malibu
1            70       1          buick skylark 320
2            70       1         plymouth satellite
3            70       1              amc rebel sst
4            70       1                ford torino
..          ...     ...                        ...
393          82       1            ford mustang gl
394          82       2                  vw pickup
395          82       1              dodge rampage
396          82       1                ford ranger
397          82       1                 chevy s-10

[398 rows x 9 columns]
mpg             0
cylinders       0
displacement    0
horsepower      6
weight          0
acceleration    0
model_year      0
origin          0
car_name        0
dtype: int64
      mpg  cylinders  displacement  horsepower  weight  acceleration  \
0    18.0          8         307.0       130.0  3504.0          12.0
1    15.0          8         350.0       165.0  3693.0          11.5
2    18.0          8         318.0       150.0  3436.0          11.0
3    16.0          8         304.0       150.0  3433.0          12.0
4    17.0          8         302.0       140.0  3449.0          10.5
..    ...        ...           ...         ...     ...           ...
393  27.0          4         140.0        86.0  2790.0          15.6
394  44.0          4          97.0        52.0  2130.0          24.6
395  32.0          4         135.0        84.0  2295.0          11.6
396  28.0          4         120.0        79.0  2625.0          18.6
397  31.0          4         119.0        82.0  2720.0          19.4

     model_year  origin                   car_name
0            70       1  chevrolet chevelle malibu
1            70       1          buick skylark 320
2            70       1         plymouth satellite
3            70       1              amc rebel sst
4            70       1                ford torino
..          ...     ...                        ...
393          82       1            ford mustang gl
394          82       2                  vw pickup
395          82       1              dodge rampage
396          82       1                ford ranger
397          82       1                 chevy s-10

[392 rows x 9 columns]

In [ ]:
max_mpg=(df['mpg'].max())
b=df[df['mpg']==max_mpg]
print(b[:])
print(df.groupby('cylinders')['displacement'].mean())
print(df['cylinders'].mean())
print(df[df['weight']>= df['weight'].mean()]['car_name'].count())

      mpg  cylinders  displacement  horsepower  weight  acceleration  \
322  46.6          4          86.0        65.0  2110.0          17.9

     model_year  origin   car_name
322          80       3  mazda glc
cylinders
3     72.500000
4    109.796569
5    145.000000
6    218.142857
8    345.009709
Name: displacement, dtype: float64
5.454773869346734
171

In [ ]:
#loading data sets
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.feature_selection import VarianceThreshold
df=pd.read_csv("/content/DATA (1).csv")
print(df.describe())
print(df.head(5))
print(df.info())
print(df.isnull().sum())
print(df.columns)
print(df.index)
X=df['COURSE ID']
y=df['GRADE']
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=42)
print(X_train.values)
df['1']=1
print(df['1'])

                1           2           3           4           5           6  \
count  145.000000  145.000000  145.000000  145.000000  145.000000  145.000000
mean     1.620690    1.600000    1.944828    3.572414    1.662069    1.600000
std      0.613154    0.491596    0.537216    0.805750    0.474644    0.491596
min      1.000000    1.000000    1.000000    1.000000    1.000000    1.000000
25%      1.000000    1.000000    2.000000    3.000000    1.000000    1.000000
50%      2.000000    2.000000    2.000000    3.000000    2.000000    2.000000
75%      2.000000    2.000000    2.000000    4.000000    2.000000    2.000000
max      3.000000    2.000000    3.000000    5.000000    2.000000    2.000000

                7           8           9          10  ...          23  \
count  145.000000  145.000000  145.000000  145.000000  ...  145.000000
mean     1.579310    1.627586    1.620690    1.731034  ...    1.337931
std      0.495381    1.020245    1.061112    0.783999  ...    0.614870
min      1.000000    1.000000    1.000000    1.000000  ...    1.000000
25%      1.000000    1.000000    1.000000    1.000000  ...    1.000000
50%      2.000000    1.000000    1.000000    2.000000  ...    1.000000
75%      2.000000    2.000000    2.000000    2.000000  ...    2.000000
max      2.000000    5.000000    4.000000    4.000000  ...    3.000000

               24          25          26          27          28          29  \
count  145.000000  145.000000  145.000000  145.000000  145.000000  145.000000
mean     1.165517    2.544828    2.055172    2.393103    1.806897    3.124138
std      0.408483    0.564940    0.674736    0.604343    0.810492    1.301083
min      1.000000    1.000000    1.000000    1.000000    1.000000    1.000000
25%      1.000000    2.000000    2.000000    2.000000    1.000000    2.000000
50%      1.000000    3.000000    2.000000    2.000000    2.000000    3.000000
75%      1.000000    3.000000    3.000000    3.000000    2.000000    4.000000
max      3.000000    3.000000    3.000000    3.000000    3.000000    5.000000

               30   COURSE ID       GRADE
count  145.000000  145.000000  145.000000
mean     2.724138    4.131034    3.227586
std      0.916536    3.260145    2.197678
min      1.000000    1.000000    0.000000
25%      2.000000    1.000000    1.000000
50%      3.000000    3.000000    3.000000
75%      3.000000    7.000000    5.000000
max      4.000000    9.000000    7.000000

[8 rows x 32 columns]
  STUDENT ID  1  2  3  4  5  6  7  8  9  ...  23  24  25  26  27  28  29  30  \
0   STUDENT1  2  2  3  3  1  2  2  1  1  ...   1   1   3   2   1   2   1   1
1   STUDENT2  2  2  3  3  1  2  2  1  1  ...   1   1   3   2   3   2   2   3
2   STUDENT3  2  2  2  3  2  2  2  2  4  ...   1   1   2   2   1   1   2   2
3   STUDENT4  1  1  1  3  1  2  1  2  1  ...   1   2   3   2   2   1   3   2
4   STUDENT5  2  2  1  3  2  2  1  3  1  ...   2   1   2   2   2   1   2   2

   COURSE ID  GRADE
0          1      1
1          1      1
2          1      1
3          1      1
4          1      1

[5 rows x 33 columns]
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145 entries, 0 to 144
Data columns (total 33 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STUDENT ID  145 non-null    object
 1   1           145 non-null    int64
 2   2           145 non-null    int64
 3   3           145 non-null    int64
 4   4           145 non-null    int64
 5   5           145 non-null    int64
 6   6           145 non-null    int64
 7   7           145 non-null    int64
 8   8           145 non-null    int64
 9   9           145 non-null    int64
 10  10          145 non-null    int64
 11  11          145 non-null    int64
 12  12          145 non-null    int64
 13  13          145 non-null    int64
 14  14          145 non-null    int64
 15  15          145 non-null    int64
 16  16          145 non-null    int64
 17  17          145 non-null    int64
 18  18          145 non-null    int64
 19  19          145 non-null    int64
 20  20          145 non-null    int64
 21  21          145 non-null    int64
 22  22          145 non-null    int64
 23  23          145 non-null    int64
 24  24          145 non-null    int64
 25  25          145 non-null    int64
 26  26          145 non-null    int64
 27  27          145 non-null    int64
 28  28          145 non-null    int64
 29  29          145 non-null    int64
 30  30          145 non-null    int64
 31  COURSE ID   145 non-null    int64
 32  GRADE       145 non-null    int64
dtypes: int64(32), object(1)
memory usage: 37.5+ KB
None
STUDENT ID    0
1             0
2             0
3             0
4             0
5             0
6             0
7             0
8             0
9             0
10            0
11            0
12            0
13            0
14            0
15            0
16            0
17            0
18            0
19            0
20            0
21            0
22            0
23            0
24            0
25            0
26            0
27            0
28            0
29            0
30            0
COURSE ID     0
GRADE         0
dtype: int64
Index(['STUDENT ID', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11',
       '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23',
       '24', '25', '26', '27', '28', '29', '30', 'COURSE ID', 'GRADE'],
      dtype='object')
RangeIndex(start=0, stop=145, step=1)
[1 1 1 8 9 1 1 8 1 2 7 8 7 8 1 1 1 1 5 1 1 1 5 3 1 1 7 1 1 1 1 5 9 1 1 6 9
 1 5 6 1 7 8 1 1 5 9 1 1 4 1 7 1 1 3 8 5 9 9 1 1 7 8 1 1 1 3 9 1 9 1 8 1 1
 7 1 9 1 9 4 8 6 1 1 6 1 6 9 1 1 3 1 9 1 1 9 1 1 7 9 1 1 9 7 7 8 6 3 8 9 1
 3 7 1 6 7]
0      1
1      1
2      1
3      1
4      1
      ..
140    1
141    1
142    1
143    1
144    1
Name: 1, Length: 145, dtype: int64

In [ ]:
#printing const features
X = df.drop(['STUDENT ID', 'COURSE ID', 'GRADE'], axis=1)
y=df['GRADE']
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=42)
constfea=[features for features in X_train.columns if X_train[features].std()==0]
print(len(constfea))
print(df.drop(constfea,axis=1))

1
     STUDENT ID  2  3  4  5  6  7  8  9  10  ...  23  24  25  26  27  28  29  \
0      STUDENT1  2  3  3  1  2  2  1  1   1  ...   1   1   3   2   1   2   1
1      STUDENT2  2  3  3  1  2  2  1  1   1  ...   1   1   3   2   3   2   2
2      STUDENT3  2  2  3  2  2  2  2  4   2  ...   1   1   2   2   1   1   2
3      STUDENT4  1  1  3  1  2  1  2  1   2  ...   1   2   3   2   2   1   3
4      STUDENT5  2  1  3  2  2  1  3  1   4  ...   2   1   2   2   2   1   2
..          ... .. .. .. .. .. .. .. ..  ..  ...  ..  ..  ..  ..  ..  ..  ..
140  STUDENT141  1  2  3  1  1  2  1  1   2  ...   1   1   2   1   2   1   3
141  STUDENT142  1  2  4  2  2  2  1  4   2  ...   1   1   3   2   2   1   5
142  STUDENT143  1  1  4  2  2  2  1  1   1  ...   1   1   3   3   2   1   4
143  STUDENT144  1  2  4  1  1  1  5  2   3  ...   2   1   2   1   2   1   5
144  STUDENT145  1  1  5  2  2  2  3  1   1  ...   2   1   3   2   3   1   5

     30  COURSE ID  GRADE
0     1          1      1
1     3          1      1
2     2          1      1
3     2          1      1
4     2          1      1
..   ..        ...    ...
140   3          9      5
141   3          9      5
142   3          9      1
143   3          9      4
144   4          9      3

[145 rows x 32 columns]

In [ ]:
=[features for features in X_train.columns if X_train[features].count_values(normalize=True).max()]